app/controllers/events_controller.rb

INSERT INTO "events" ("name", "date", "start", "venue", "image", "api_id", "created_at", "updated_at", "city", "state") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
INSERT INTO "user_events" ("event_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["event_id", 5], ["user_id", 2], ["created_at", "2019-12-05 14:30:47.819985"], ["updated_at", "2019-12-05 14:30:47.819985"]]
---
    def create
        event = Event.create(name: params[:name], date: params[:date], start: params[:start], venue: params[:venue], image: params[:image])
        userevent = UserEvent.create(event_id: event.id, user_id: params[:user_id])

SELECT "events".* FROM "events" WHERE (vv1ke8v9GZGA2op8k) LIMIT $1  [["LIMIT", 1]]
---
    def delete
        event = Event.find_by(params[:event_id])