app/controllers/users_controller.rb

    def create
        newUser = User.create(name: params["name"], password: params["phone_number"], email: params["email"])
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "yo"], ["email", "yo"], ["created_at", "2019-12-03 22:12:19.912364"], ["updated_at", "2019-12-03 22:12:19.912364"]]

    def login
        user = User.find_by(name: params["name"])
---
SELECT "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "yo"], ["LIMIT", 1]]